namespace TgBot_librarian.Resources
{
    public static class LibraryHistoryTexts
    {
        public static readonly string HistoryText =
            "Козелецька центральна бібліотека заснована у жовтні 1917 року, як публічна бібліотека м. Козельця. \n" +
            "Першочергово її фонд складали газети, матеріали різних партій, а також книги, подаровані її засновниками. \n" +
            "Особливо гостро представниками різних партій протягом 1917-19 рр. ставилось питання про завідуючого бібліотекою. \n" +
            "В той час завідувачі змінювалися дуже часто, адже кожна політична сила, що приходила до влади в місті, призначала завідуючим свого представника.\n\n" +
            "Після встановлення Радянської влади, бібліотека зазнає ряд організаційних змін: вона була і міською, і повітовою, і, нарешті з 1925 р. - районною.\n" +
            "В тридцяті роки минулого століття до заслуг діяльності бібліотеки можна віднести лише роботу по ліквідації неграмотності серед населення. \n\n" +
            "Під час Великої Вітчизняної війни коли німецькі війська увійшли в місто гинули мирні жителі і руйнувалися надбання культури. " +
            "І сьогодні у фонді бібліотеки знаходиться том Енциклопедії Брокгауза та Ефрона, прострілений наскрізь кулею. Після визволення міста, бібліотека відновлює свою " +
            "роботу лише 1 березня 1947 року. Фонд бібліотеки на той час складав лише 875 примірників. Це були, в основному, книги, передані з інших бібліотек та частина книг, " +
            "які не були знищені фашистськими загарбниками. \n\nА вже з початку 50-х років фонд бібліотеки інтенсивно поповнюється. Так, 3-го серпня 1952 року районна газета " +
            "«Розгорнутим фронтом» писала: «За сім місяців 1952 року в Козелецьку районну бібліотеку надійшло 1099 примірників літератури».\n\n" +
            "В серпні - на початку вересня 1958 року бібліотека переїжджає в будинок полкової канцелярії Київського полку, де вона знаходиться і до цього часу.\n\n" +
            "Сьогодні в Козелецькій бібліотеці працює 17 фахівців, в т. ч. 11 з вищою бібліотечною освітою. До послуг користувачів бібліотеки 33 тисячі документів, " +
            "які розміщені у відділі обслуговування з читальним залом на 20 робочих місць та відділі краєзнавчої літератури та бібліографії. " +
            "Щороку бібліотека обслуговує понад 3 тис. користувачів, видає їм понад 70 тис. документів. \n\nБудинок полкової канцелярії в якому зараз розташовується бібліотека, " +
            "збудований на замовлення зятя Розумовських - київського полковника Юхима Дарагана у 1756 - 1765 рр. \nЦе пам’ятка цивільної архітектури XVIII ст. одна із двох збережених " +
            "адміністративних будівель канцелярій козацьких полків.";
    }
}